In [2]:
# Na początek utworzymy dwa przykładowe DataFrame, które będziemy łączyć i mergować

import pandas as pd

# DataFrame 1
data1 = {
    'ID': [1, 2, 3, 4],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40]
}
df1 = pd.DataFrame(data1)

# DataFrame 2
data2 = {
    'ID': [3, 4, 5, 6],
    'Name': ['Charlie', 'David', 'Edward', 'Fiona'],
    'Salary': [70000, 80000, 90000, 100000]
}
df2 = pd.DataFrame(data2)

print("DataFrame 1:")
print(df1)
print("\nDataFrame 2:")
print(df2)

DataFrame 1:
   ID     Name  Age
0   1    Alice   25
1   2      Bob   30
2   3  Charlie   35
3   4    David   40

DataFrame 2:
   ID     Name  Salary
0   3  Charlie   70000
1   4    David   80000
2   5   Edward   90000
3   6    Fiona  100000

## Operacje typu JOIN

In [3]:
inner_join = pd.merge(df1, df2, on='ID', how='inner')
inner_join

   ID   Name_x  Age   Name_y  Salary
0   3  Charlie   35  Charlie   70000
1   4    David   40    David   80000

In [4]:
left_join = pd.merge(df1, df2, on='ID', how='left')
left_join

   ID   Name_x  Age   Name_y   Salary
0   1    Alice   25      NaN      NaN
1   2      Bob   30      NaN      NaN
2   3  Charlie   35  Charlie  70000.0
3   4    David   40    David  80000.0

In [5]:
right_join = pd.merge(df1, df2, on='ID', how='right')
right_join

   ID   Name_x   Age   Name_y  Salary
0   3  Charlie  35.0  Charlie   70000
1   4    David  40.0    David   80000
2   5      NaN   NaN   Edward   90000
3   6      NaN   NaN    Fiona  100000

In [6]:
outer_join = pd.merge(df1, df2, on='ID', how='outer')
outer_join

   ID   Name_x   Age   Name_y    Salary
0   1    Alice  25.0      NaN       NaN
1   2      Bob  30.0      NaN       NaN
2   3  Charlie  35.0  Charlie   70000.0
3   4    David  40.0    David   80000.0
4   5      NaN   NaN   Edward   90000.0
5   6      NaN   NaN    Fiona  100000.0

In [7]:
products = pd.DataFrame({
    'Product': ['Shirt', 'Shoes'],
    'Price_Base': [25, 30]
})

sizes = pd.DataFrame({
    'Size': ['S', 'M', 'L'],
    'Price_Factor': [1.1, 1.2, 1.3]
})

products['key'] = 1
sizes['key'] = 1

articles = pd.merge(products, sizes, on='key')
articles['Price'] = articles['Price_Base'] * articles['Price_Factor']

articles

  Product  Price_Base  key Size  Price_Factor  Price
0   Shirt          25    1    S           1.1   27.5
1   Shirt          25    1    M           1.2   30.0
2   Shirt          25    1    L           1.3   32.5
3   Shoes          30    1    S           1.1   33.0
4   Shoes          30    1    M           1.2   36.0
5   Shoes          30    1    L           1.3   39.0

## Operacje typu UNION

In [8]:
f5 = pd.DataFrame({
    'ID': [1, 2],
    'Name': ['Alice', 'Bob']
})

df6 = pd.DataFrame({
    'ID': [3, 2],
    'Name': ['John', 'Bob']
})

In [9]:
union_all_df = pd.concat([f5, df6])
union_all_df

   ID   Name
0   1  Alice
1   2    Bob
0   3   John
1   2    Bob

In [10]:
union_df = pd.concat([f5, df6]).drop_duplicates()
union_df

   ID   Name
0   1  Alice
1   2    Bob
0   3   John

In [11]:
union_all_df2 = pd.concat([f5, df6], ignore_index=True)
union_all_df2

   ID   Name
0   1  Alice
1   2    Bob
2   3   John
3   2    Bob